centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
#ifndef IGB_STM32_PERIPH_SPI_H
#define IGB_STM32_PERIPH_SPI_H

#include <igb_stm32/base.hpp>
#include <igb_util/cast.hpp>
#include <igb_stm32/periph/gpio.hpp>
#include <igb_stm32/periph/rcc.hpp>
#include <igb_util/macro.hpp>

namespace igb {
namespace stm32 {

enum class SpiMode : uint32_t {
  SLAVE  = 0,
#if defined(STM32H7)
  MASTER = SPI_CFG2_MASTER,
#else
  MASTER = (SPI_CR1_MSTR | SPI_CR1_SSI),
#endif
};

enum class SpiStandard : uint32_t {
  MOTOROLA = 0,
#if defined(STM32H7)
  TI = SPI_CFG2_SP_0,
#else
  TI = SPI_CR2_FRF,
#endif
};

enum class SpiClockPhase : uint32_t {
  ONE_EDGE = 0,
#if defined(STM32H7)
  TWO_EDGE = SPI_CFG2_CPHA,
#else
  TWO_EDGE = SPI_CR1_CPHA,
#endif
};

enum class SpiClockPolarity : uint32_t {
  LOW = 0,
#if defined(STM32H7)
  HIGH = SPI_CFG2_CPOL,
#else
  HIGH = SPI_CR1_CPOL,
#endif
};

enum class SpiBaudratePrescaler : uint32_t {
  DIV2 = 0,
#if defined(STM32H7)
  DIV4 = SPI_CFG1_MBR_0,
  DIV8 = SPI_CFG1_MBR_1,
  DIV16 = SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0,
  DIV32 = SPI_CFG1_MBR_2,
  DIV64 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_0,
  DIV128 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1,
  DIV256 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0,
#else
  DIV4 = SPI_CR1_BR_0,
  DIV8 = SPI_CR1_BR_1,
  DIV16 = SPI_CR1_BR_1 | SPI_CR1_BR_0,
  DIV32 = SPI_CR1_BR_2,
  DIV64 = SPI_CR1_BR_2 | SPI_CR1_BR_0,
  DIV128 = SPI_CR1_BR_2 | SPI_CR1_BR_1,
  DIV256 = SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
#endif
};

enum class SpiBitOrder : uint32_t {
  MSB_FIRST = 0,
#if defined(STM32H7)
  LSB_FIRST = SPI_CFG2_LSBFRST,
#else
  LSB_FIRST = SPI_CR1_LSBFIRST,
#endif
};

enum class SpiTransDir : uint32_t {
  FULL_DUPLEX = 0,
#if defined(STM32H7)
  SIMPLEX_TX = SPI_CFG2_COMM_0,
  SIMPLEX_RX = SPI_CFG2_COMM_1,
  HALF_DUPLEX_RX = SPI_CFG2_COMM_0 | SPI_CFG2_COMM_1,
  HALF_DUPLEX_TX = SPI_CFG2_COMM_0 | SPI_CFG2_COMM_1 | SPI_CR1_HDDIR,
#else
  SIMPLEX_RX  = SPI_CR1_RXONLY,
  HALF_DUPLEX_RX = SPI_CR1_BIDIMODE,
  HALF_DUPLEX_TX = SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE,
#endif
};

enum class SpiDataWidth : uint32_t {
#if defined(STM32H7)
  _4BIT = SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1,
  _5BIT = SPI_CFG1_DSIZE_2,
  _6BIT = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _7BIT = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _8BIT = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _9BIT = SPI_CFG1_DSIZE_3,
  _10BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0,
  _11BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1,
  _12BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _13BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2,
  _14BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _15BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _16BIT = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _17BIT = SPI_CFG1_DSIZE_4,
  _18BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0,
  _19BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_1,
  _20BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1,
  _21BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2,
  _22BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _23BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _24BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _25BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3,
  _26BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0,
  _27BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1,
  _28BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _29BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2,
  _30BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _31BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _32BIT = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
#elif defined(STM32F4)
  _8BIT = 0,
  _16BIT = SPI_CR1_DFF,
#else
  _4BIT = SPI_CR2_DS_0 | SPI_CR2_DS_1,
  _5BIT = SPI_CR2_DS_2,
  _6BIT = SPI_CR2_DS_2 | SPI_CR2_DS_0,
  _7BIT = SPI_CR2_DS_2 | SPI_CR2_DS_1,
  _8BIT = SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
  _9BIT = SPI_CR2_DS_3,
  _10BIT = SPI_CR2_DS_3 | SPI_CR2_DS_0,
  _11BIT = SPI_CR2_DS_3 | SPI_CR2_DS_1,
  _12BIT = SPI_CR2_DS_3 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
  _13BIT = SPI_CR2_DS_3 | SPI_CR2_DS_2,
  _14BIT = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_0,
  _15BIT = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_1,
  _16BIT = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
#endif
};

#if defined(STM32H7)
enum class SpiFifoThreshold : uint32_t {
  _1DATA = 0,
  _2DATA = SPI_CFG1_FTHLV_0,
  _3DATA = SPI_CFG1_FTHLV_1,
  _4DATA = SPI_CFG1_FTHLV_0 | SPI_CFG1_FTHLV_1,
  _5DATA = SPI_CFG1_FTHLV_2,
  _6DATA = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0,
  _7DATA = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1,
  _8DATA = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
  _9DATA = SPI_CFG1_FTHLV_3,
  _10DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_0,
  _11DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1,
  _12DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
  _13DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2,
  _14DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0,
  _15DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1,
  _16DATA = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
};
#elif defined(STM32F0) || defined(STM32F3)
enum class SpiFifoThreshold : uint32_t {
  HALF = 0,
  QUARTER = SPI_CR2_FRXTH,
};
#endif

#if defined(STM32H7)
enum class SpiCrcWidth : uint32_t {
  _4BIT = SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1,
  _5BIT = SPI_CFG1_CRCSIZE_2,
  _6BIT = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0,
  _7BIT = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1,
  _8BIT = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _9BIT = SPI_CFG1_CRCSIZE_3,
  _10BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0,
  _11BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1,
  _12BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _13BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2,
  _14BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0,
  _15BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1,
  _16BIT = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _17BIT = (SPI_CFG1_CRCSIZE_4),
  _18BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0),
  _19BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_1),
  _20BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1),
  _21BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2),
  _22BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0),
  _23BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1),
  _24BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
  _25BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3),
  _26BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0),
  _27BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1),
  _28BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
  _29BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2),
  _30BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0),
  _31BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1),
  _32BIT = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
};
