centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
#elif defined(STM32F0) || defined(STM32F3)
enum class SpiCrcWidth : uint32_t {
  _8BIT = 0,
  _16BIT = SPI_CR1_CRCL,
};
#endif

enum class SpiNssMode : uint32_t {
#if defined(STM32H7)
  HARD_INPUT  = 0,
  HARD_OUTPUT = SPI_CFG2_SSOE,
  SOFT        = SPI_CFG2_SSM,
#else
  HARD_INPUT  = 0,
  HARD_OUTPUT = SPI_CR1_SSM,
  SOFT        = SPI_CR1_SSM,
#endif
};

#if defined(STM32H7)
enum class SpiNssPolarity : uint32_t {
  LOW = 0,
  HIGH = SPI_CFG2_SSIOP,
};
#endif

enum class SpiState : uint32_t {
#if defined(STM32H7)
  RX_WORD_NOT_EMPTY   = SPI_SR_RXWNE,
  RX_PACKET_ABAILABLE = SPI_SR_RXP,
  TX_PACKET_ABAILABLE = SPI_SR_TXP,
  DX_PACKET_ABAILABLE = SPI_SR_DXP,
  END_OF_TRANSFER     = SPI_SR_EOT,
  TX_TRANSFER_FULL    = SPI_SR_TXTF,
  UNDERRUN            = SPI_SR_UDR,
  CRC_ERROR           = SPI_SR_CRCE,
  MODE_FAULT          = SPI_SR_MODF,
  OVERRUN             = SPI_SR_OVR,
  FRAME_FORMAT_ERROR  = SPI_SR_TIFRE,
  DATA_RELOADED       = SPI_SR_TSERF,
  SUSPEND_DONE        = SPI_SR_SUSP,
#else
  RX_BUF_NOT_EMPTY   = SPI_SR_RXNE,
  TX_BUF_EMPTY       = SPI_SR_TXE,
  BUSY               = SPI_SR_BSY,
  CRC_ERROR          = SPI_SR_CRCERR,
  MODE_FAULT         = SPI_SR_MODF,
  OVERRUN            = SPI_SR_OVR,
  FRAME_FORMAT_ERROR = SPI_SR_FRE,
#endif
};

enum class SpiInterruptType : uint32_t {
#if defined(STM32H7)
  RX_PACKET_ABAILABLE = SPI_IER_RXPIE,
  TX_PACKET_ABAILABLE = SPI_IER_TXPIE,
  DX_PACKET_ABAILABLE = SPI_IER_DXPIE,
  END_OF_TRANSFER     = SPI_IER_EOTIE,
  TX_TRANSFER_FULL    = SPI_IER_TXTFIE,
  UNDERRUN            = SPI_IER_UDRIE,
  OVERRUN             = SPI_IER_OVRIE,
  CRC_ERROR           = SPI_IER_CRCEIE,
  FRAME_FORMAT_ERROR  = SPI_IER_TIFREIE,
  MODE_FAULT          = SPI_IER_MODFIE,
  DATA_RELOADED       = SPI_IER_TSERFIE,
#else
  RX_BUF_NOT_EMPTY = SPI_CR2_RXNEIE,
  TX_BUF_EMPTY     = SPI_CR2_TXEIE,
  ERROR            = SPI_CR2_ERRIE,
#endif
};

enum class SpiDmaReqTarget : uint32_t {
#if defined(STM32H7)
  RX = SPI_CFG1_RXDMAEN,
  TX = SPI_CFG1_TXDMAEN,
#else
  RX = SPI_CR2_RXDMAEN,
  TX = SPI_CR2_TXDMAEN,
#endif
};

#if !defined(STM32H7)
enum class SpiDmaParityTarget : uint32_t {
  RX = SPI_CR2_RXDMAEN,
  TX = SPI_CR2_TXDMAEN,
};

enum class SpiDmaParityType : uint32_t {
  EVEN = 0,
  ODD  = 1,
};
#endif

struct Spi {
  const SpiType type;
  SPI_TypeDef* p_spi;

  IGB_FAST_INLINE void enable() {
    p_spi->CR1 |= SPI_CR1_SPE;
  }

  IGB_FAST_INLINE void disable() {
    p_spi->CR1 &= ~SPI_CR1_SPE;
  }

  IGB_FAST_INLINE void setMode(SpiMode mode) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_MASTER, as<uint32_t>(mode));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_MSTR | SPI_CR1_SSI, as<uint32_t>(mode));
#endif
  }

  IGB_FAST_INLINE void setStandard(SpiStandard standard) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_SP, as<uint32_t>(standard));
#else
    MODIFY_REG(p_spi->CR2, SPI_CR2_FRF, as<uint32_t>(standard));
#endif
  }

  IGB_FAST_INLINE void setClockPhase(SpiClockPhase phase) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_CPHA, as<uint32_t>(phase));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_CPHA, as<uint32_t>(phase));
#endif
  }

  IGB_FAST_INLINE void setClockPolarity(SpiClockPolarity polarity) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_CPOL, as<uint32_t>(polarity));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_CPOL, as<uint32_t>(polarity));
#endif
  }

  IGB_FAST_INLINE void setBaudratePrescaler(SpiBaudratePrescaler prescaler) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG1, SPI_CFG1_MBR, as<uint32_t>(prescaler));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_BR, as<uint32_t>(prescaler));
#endif
  }

  IGB_FAST_INLINE void setTransBitOrder(SpiBitOrder order) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_LSBFRST, as<uint32_t>(order));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_LSBFIRST, as<uint32_t>(order));
#endif
  }

  IGB_FAST_INLINE void setTransDir(SpiTransDir dir) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CR1, SPI_CR1_HDDIR,  as<uint32_t>(dir) & SPI_CR1_HDDIR);
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_COMM, as<uint32_t>(dir) & SPI_CFG2_COMM);
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE, as<uint32_t>(dir));
#endif
  }

#if defined(STM32H7)
  IGB_FAST_INLINE void setDataWidth(SpiDataWidth data_width) {
    MODIFY_REG(p_spi->CFG1, SPI_CFG1_DSIZE, as<uint32_t>(data_width));
  }
#elif defined(STM32F0) || defined(STM32F3)
  IGB_FAST_INLINE void setDataWidth(SpiDataWidth data_width) {
    MODIFY_REG(p_spi->CR2, SPI_CR2_DS, as<uint32_t>(data_width));
  }
#elif defined(STM32F4)
  IGB_FAST_INLINE void setDataWidth(SpiDataWidth data_width) {
    MODIFY_REG(p_spi->CR1, SPI_CR1_DFF, as<uint32_t>(data_width));
  }
#endif

#if defined(STM32H7)
  IGB_FAST_INLINE void setFifoThreshold(SpiFifoThreshold threshold) {
    MODIFY_REG(p_spi->CFG1, SPI_CFG1_FTHLV, as<uint32_t>(threshold));
  }
#elif defined(STM32F0) || defined(STM32F3)
  IGB_FAST_INLINE void setRxFifoThreshold(SpiFifoThreshold threshold) {
    MODIFY_REG(p_spi->CR2, SPI_CR2_FRXTH, as<uint32_t>(threshold));
  }
#endif

  IGB_FAST_INLINE void setCrc(bool enable) {
#if defined(STM32H7)
    if (enable) {
      SET_BIT(p_spi->CFG1, SPI_CFG1_CRCEN);
    } else {
      CLEAR_BIT(p_spi->CFG1, SPI_CFG1_CRCEN);
    }
#else
    if (enable) {
      p_spi->CR1 |= SPI_CR1_CRCEN;
    } else {
      p_spi->CR1 &= ~SPI_CR1_CRCEN;
    }
#endif
  }

#if defined(STM32H7)
  IGB_FAST_INLINE void setCrcWidth(SpiCrcWidth width) {
    MODIFY_REG(p_spi->CFG1, SPI_CFG1_CRCSIZE, as<uint32_t>(width));
  }
#elif defined(STM32F0) || defined(STM32F3)
  IGB_FAST_INLINE void setCrcWidth(SpiCrcWidth width) {
    MODIFY_REG(p_spi->CR1, SPI_CR1_CRCL, as<uint32_t>(width));
  }
#endif

#if !defined(STM32H7)
  IGB_FAST_INLINE void setCrcNext() {
    p_spi->CR1 |= SPI_CR1_CRCNEXT;
  }
#endif

  IGB_FAST_INLINE void setCrcPolynomial(uint32_t poly) {
#if defined(STM32H7)
    WRITE_REG(p_spi->CRCPOLY, poly);
#else
    p_spi->CRCPR = (uint16_t)poly;
#endif
  }

  IGB_FAST_INLINE uint32_t getRxCrc() {
#if defined(STM32H7)
    return (uint32_t)(READ_REG(p_spi->RXCRC));
#else
    return (uint32_t)(p_spi->RXCRCR);
#endif
  }

