centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
  IGB_FAST_INLINE uint32_t getTxCrc() {
#if defined(STM32H7)
    return (uint32_t)(READ_REG(p_spi->TXCRC));
#else
    return (uint32_t)(p_spi->TXCRCR);
#endif
  }

  IGB_FAST_INLINE void setNssMode(SpiNssMode mode) {
#if defined(STM32H7)
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_SSM | SPI_CFG2_SSOE, as<uint32_t>(mode));
#else
    MODIFY_REG(p_spi->CR1, SPI_CR1_SSM,  as<uint32_t>(mode));
    MODIFY_REG(p_spi->CR2, SPI_CR2_SSOE, ((uint32_t)(as<uint32_t>(mode) >> 16U)));
#endif
  }

#if defined(STM32H7)
  IGB_FAST_INLINE void setNssPulseMng(bool enable) {
    if (enable) {
      SET_BIT(p_spi->CFG2, SPI_CFG2_SSOM);
    } else {
      CLEAR_BIT(p_spi->CFG2, SPI_CFG2_SSOM);
    }
  }
#elif defined(STM32F0) || defined(STM32F3)
  IGB_FAST_INLINE void setNssPulseMng(bool enable) {
    if (enable) {
      p_spi->CR2 |= SPI_CR2_NSSP;
    } else {
      p_spi->CR2 &= ~SPI_CR2_NSSP;
    }
  }
#endif

#if defined(STM32H7)
  IGB_FAST_INLINE void setNssPolarity(SpiNssPolarity polarity) {
    MODIFY_REG(p_spi->CFG2, SPI_CFG2_SSIOP, as<uint32_t>(polarity));
  }
#endif

  IGB_FAST_INLINE bool isState(SpiState state) {
    return !!(p_spi->SR & as<uint32_t>(state));
  }
  
  IGB_FAST_INLINE void clearState(SpiState state) {
    CLEAR_BIT(p_spi->SR, as<uint32_t>(state));
  }

  IGB_FAST_INLINE void enableInterrupt(SpiInterruptType type) {
#if defined(STM32H7)
    SET_BIT(p_spi->IER, as<uint32_t>(type));
#else
    p_spi->CR2 |= as<uint32_t>(type);
#endif
  }

  IGB_FAST_INLINE void disableInterrupt(SpiInterruptType type) {
#if defined(STM32H7)
    CLEAR_BIT(p_spi->IER, as<uint32_t>(type));
#else
    p_spi->CR2 &= ~(as<uint32_t>(type));
#endif
  }

  IGB_FAST_INLINE void enableDmaReq(SpiDmaReqTarget type) {
#if defined(STM32H7)
    SET_BIT(p_spi->CFG1, as<uint32_t>(type));
#else
    p_spi->CR2 |= as<uint32_t>(type);
#endif
  }

  IGB_FAST_INLINE void disableDmaReq(SpiDmaReqTarget type) {
#if defined(STM32H7)
    CLEAR_BIT(p_spi->CFG1, as<uint32_t>(type));
#else
    p_spi->CR2 &= ~(as<uint32_t>(type));
#endif
  }

#if defined(STM32F0) || defined(STM32F3)
  IGB_FAST_INLINE void setDmaParity(SpiDmaParityTarget target, SpiDmaParityType type) {
    switch (target) {
      case SpiDmaParityTarget::TX:
        MODIFY_REG(p_spi->CR2, SPI_CR2_LDMATX, (as<uint32_t>(type) << SPI_CR2_LDMATX_Pos));
        break;
      case SpiDmaParityTarget::RX:
        MODIFY_REG(p_spi->CR2, SPI_CR2_LDMARX, (as<uint32_t>(type) << SPI_CR2_LDMARX_Pos));
        break;
    }
  }

  IGB_FAST_INLINE uint32_t getRegAddr() {
    return (uint32_t) &(p_spi->DR);
  }
#endif

#if defined(STM32H7)
  IGB_FAST_INLINE void setTransferSize(uint32_t count) {
    MODIFY_REG(p_spi->CR2, SPI_CR2_TSIZE, count);
  }

  IGB_FAST_INLINE void startMasterTransfer() {
    SET_BIT(p_spi->CR1, SPI_CR1_CSTART);
  }
#endif

  IGB_FAST_INLINE uint8_t receiveU8() {
#if defined(STM32H7)
    return (*((__IO uint8_t *)&p_spi->RXDR));
#else
    return (uint8_t)(p_spi->DR);
#endif
  }

  IGB_FAST_INLINE uint8_t receiveU8sync() {
#if defined(STM32H7)
    while (!isState(SpiState::RX_PACKET_ABAILABLE));
    return receiveU8();
#else
    while (!isState(SpiState::RX_BUF_NOT_EMPTY));
    return receiveU8();
#endif
  }

  IGB_FAST_INLINE uint16_t receiveU16() {
#if defined(STM32H7)
    return (uint16_t)(READ_REG(p_spi->RXDR));
#else
    return (uint16_t)(p_spi->DR);
#endif
  }

  IGB_FAST_INLINE uint8_t receiveU16sync() {
#if defined(STM32H7)
    while (!isState(SpiState::RX_PACKET_ABAILABLE));
    return receiveU16();
#else
    while (!isState(SpiState::RX_BUF_NOT_EMPTY));
    return receiveU16();
#endif
  }

  IGB_FAST_INLINE void sendU8(uint8_t data) {
#if defined(STM32H7)
    *((__IO uint8_t *)&p_spi->TXDR) = data;
#else
#if defined (__GNUC__)
    __IO uint8_t *spidr = ((__IO uint8_t *)&p_spi->DR);
    *spidr = data;
#else
    *((__IO uint8_t *)&p_spi->DR) = data;
#endif /* __GNUC__ */
#endif
  }

  IGB_FAST_INLINE void sendU8sync(uint8_t data) {
#if defined(STM32H7)
    disable();
    setTransferSize(1);
    enable();
    startMasterTransfer();
    while (!isState(SpiState::TX_PACKET_ABAILABLE));
    sendU8(data);
    while (!isState(SpiState::END_OF_TRANSFER));
    SET_BIT(p_spi->IFCR, SPI_IFCR_EOTC);
    SET_BIT(p_spi->IFCR, SPI_IFCR_TXTFC);
    disable();
    p_spi->IER &= (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    CLEAR_BIT(p_spi->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
#else
    while (isState(SpiState::BUSY));
    while (!isState(SpiState::TX_BUF_EMPTY));
    sendU8(data);
#endif /* __GNUC__ */
  }

  IGB_FAST_INLINE void sendU16(uint16_t data) {
#if defined(STM32H7)
#if defined (__GNUC__)
  __IO uint16_t *spitxdr = ((__IO uint16_t *)&p_spi->TXDR);
  *spitxdr = data;
#else
  p_spi->TXDR = data;
#endif
#else
#if defined (__GNUC__)
  __IO uint16_t *spidr = ((__IO uint16_t *)&p_spi->DR);
  *spidr = data;
#else
  p_spi->DR = data;
#endif /* __GNUC__ */
#endif /* defined(STM32H7) */
  }

  IGB_FAST_INLINE void sendU16sync(uint8_t data) {
#if defined(STM32H7)
    disable();
    setTransferSize(1);
    enable();
    startMasterTransfer();
    while (!isState(SpiState::TX_PACKET_ABAILABLE));
    sendU16(data);
    while (!isState(SpiState::END_OF_TRANSFER));
    SET_BIT(p_spi->IFCR, SPI_IFCR_EOTC);
    SET_BIT(p_spi->IFCR, SPI_IFCR_TXTFC);
    disable();
    p_spi->IER &= (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    CLEAR_BIT(p_spi->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
#else
    while (isState(SpiState::BUSY));
    while (!isState(SpiState::TX_BUF_EMPTY));
    sendU16(data);
#endif /* __GNUC__ */
  }

  IGB_FAST_INLINE uint8_t transferU8sync(uint8_t data) {
#if defined(STM32H7)
    disable();
    setTransferSize(1);
    enable();
    startMasterTransfer();
    while (!isState(SpiState::TX_PACKET_ABAILABLE));
    sendU8(data);
    while (!isState(SpiState::RX_PACKET_ABAILABLE));
    uint8_t result = receiveU8();
    while (!isState(SpiState::END_OF_TRANSFER));
    SET_BIT(p_spi->IFCR, SPI_IFCR_EOTC);
    SET_BIT(p_spi->IFCR, SPI_IFCR_TXTFC);
    disable();
    p_spi->IER &= (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    CLEAR_BIT(p_spi->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
    return result;
#else
    while (isState(SpiState::BUSY));
    while (!isState(SpiState::TX_BUF_EMPTY));
    sendU8(data);
    while (!isState(SpiState::RX_BUF_NOT_EMPTY));
    return receiveU8();
#endif
  }

  static IGB_FAST_INLINE Spi newSpi(const SpiType spi_type) {
    return Spi {
      .type = spi_type,
      .p_spi = STM32_PERIPH_INFO.spi[as<uint8_t>(spi_type)].p_spi
    };
  }

  IGB_FAST_INLINE void prepareGpio(GpioPinType pin_type) {
    auto periph_type = as_periph_type(type);
    if (!periph_type) { return; }

    auto result = get_af_idx(periph_type.value(), pin_type);
    if (!result) { return; }

