centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
    GpioType gpio_type = extract_gpio_type(pin_type);
    GpioPin pin = GpioPin::newPin(pin_type);
    pin.setMode(GpioMode::ALTERNATE);
    pin.setPullMode(GpioPullMode::NO);
    pin.setSpeedMode(GpioSpeedMode::HIGH);
    pin.setOutputMode(GpioOutputMode::PUSHPULL);
    pin.setAlternateFunc(result.value());
    pin.enable();
  }

  IGB_FAST_INLINE void initDefault() {
#if defined(STM32H7)
    setNssPolarity(SpiNssPolarity::LOW);
    setStandard(SpiStandard::MOTOROLA);
    setFifoThreshold(SpiFifoThreshold::_1DATA);
    setNssPulseMng(false);

    setCrc(false);
    setDataWidth(SpiDataWidth::_8BIT);

    SET_BIT(p_spi->CR1, SPI_CR1_SSI); // avoid a MODF Error

    setNssMode(SpiNssMode::SOFT);
    setClockPolarity(SpiClockPolarity::LOW);
    setClockPhase(SpiClockPhase::ONE_EDGE);
    setTransBitOrder(SpiBitOrder::MSB_FIRST);
    setMode(SpiMode::MASTER);
    setTransDir(SpiTransDir::FULL_DUPLEX);
#elif defined(STM32F0) || defined(STM32F3)
    setTransDir(SpiTransDir::FULL_DUPLEX);
    setMode(SpiMode::MASTER);
    setDataWidth(SpiDataWidth::_8BIT);
    setClockPolarity(SpiClockPolarity::LOW);
    setClockPhase(SpiClockPhase::ONE_EDGE);
    setNssMode(SpiNssMode::SOFT);
    setTransBitOrder(SpiBitOrder::MSB_FIRST);
    setCrc(false);
    setCrcPolynomial(7);
    setStandard(SpiStandard::MOTOROLA);
    setRxFifoThreshold(SpiFifoThreshold::QUARTER);
    setNssPulseMng(true);
#endif
  }

  IGB_FAST_INLINE void prepareSpiMaster(GpioPinType mosi_pin, GpioPinType miso_pin, GpioPinType sck_pin, SpiBaudratePrescaler prescaler) {
    const auto& spi_info = STM32_PERIPH_INFO.spi[as<uint8_t>(type)];
    spi_info.bus.enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(miso_pin);
    prepareGpio(sck_pin);

    setBaudratePrescaler(prescaler);
    initDefault();
    enable();
  }

  IGB_FAST_INLINE void prepareSpiMasterOutOnly(GpioPinType mosi_pin, GpioPinType sck_pin, SpiBaudratePrescaler prescaler) {
    const auto& spi_info = STM32_PERIPH_INFO.spi[as<uint8_t>(type)];
    spi_info.bus.enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(sck_pin);

#if defined(STM32H7)
    setNssPolarity(SpiNssPolarity::LOW);
    setStandard(SpiStandard::MOTOROLA);
    setFifoThreshold(SpiFifoThreshold::_1DATA);
    setNssPulseMng(false);

    setBaudratePrescaler(prescaler);
    setCrc(false);
    setDataWidth(SpiDataWidth::_8BIT);

    SET_BIT(p_spi->CR1, SPI_CR1_SSI); // avoid a MODF Error

    setNssMode(SpiNssMode::SOFT);
    setClockPolarity(SpiClockPolarity::LOW);
    setClockPhase(SpiClockPhase::ONE_EDGE);
    setTransBitOrder(SpiBitOrder::MSB_FIRST);
    setMode(SpiMode::MASTER);
    setTransDir(SpiTransDir::SIMPLEX_TX);
#if defined(SPI_I2SCFGR_I2SMOD)
    CLEAR_BIT(p_spi->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    CLEAR_BIT(p_spi->CR1, SPI_CR1_TCRCINI);
    CLEAR_BIT(p_spi->CR1, SPI_CR1_RCRCINI);
    CLEAR_BIT(p_spi->CFG2, SPI_CFG2_AFCNTR);
    CLEAR_BIT(p_spi->CFG2, SPI_CFG2_IOSWP);
    MODIFY_REG(p_spi->CFG2, 0xFFUL, 0x00UL);
#else
    setBaudratePrescaler(prescaler);
    initDefault();
#endif
    enable();
  }

  IGB_FAST_INLINE void prepareSpiMasterOutOnlyHardSS(GpioPinType mosi_pin, GpioPinType sck_pin, GpioPinType cs_pin, SpiBaudratePrescaler prescaler) {
    const auto& spi_info = STM32_PERIPH_INFO.spi[as<uint8_t>(type)];
    spi_info.bus.enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(sck_pin);
    prepareGpio(cs_pin);

#if defined(STM32H7)
    setNssPolarity(SpiNssPolarity::LOW);
    setStandard(SpiStandard::MOTOROLA);
    setFifoThreshold(SpiFifoThreshold::_1DATA);
    setNssPulseMng(true);

    setBaudratePrescaler(prescaler);
    setCrc(false);
    setDataWidth(SpiDataWidth::_8BIT);

    SET_BIT(p_spi->CR1, SPI_CR1_SSI); // avoid a MODF Error

    setNssMode(SpiNssMode::HARD_OUTPUT);
    setClockPolarity(SpiClockPolarity::LOW);
    setClockPhase(SpiClockPhase::ONE_EDGE);
    setTransBitOrder(SpiBitOrder::MSB_FIRST);
    setMode(SpiMode::MASTER);
    setTransDir(SpiTransDir::SIMPLEX_TX);
#if defined(SPI_I2SCFGR_I2SMOD)
    CLEAR_BIT(p_spi->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    CLEAR_BIT(p_spi->CR1, SPI_CR1_TCRCINI);
    CLEAR_BIT(p_spi->CR1, SPI_CR1_RCRCINI);
    CLEAR_BIT(p_spi->CFG2, SPI_CFG2_AFCNTR);
    CLEAR_BIT(p_spi->CFG2, SPI_CFG2_IOSWP);
    MODIFY_REG(p_spi->CFG2, 0xFFUL, 0x00UL);
#else
    setBaudratePrescaler(prescaler);
    initDefault();
#endif
    enable();
  }

};

}
}

#endif /* IGB_STM32_PERIPH_SPI_H */
